[
    {
        "id":"shingeki-no-kyojin",
        "title": "Shingeki no Kyojin - Season 1",
        "year": 2013,
        "genres": ["Shonen","Drama","Suspense"],
        "studio": "WIT Studio",
        "plot": "Centuries ago, mankind was slaughtered to near extinction by monstrous humanoid creatures called Titans, forcing humans to hide in fear behind enormous concentric walls. What makes these giants truly terrifying is that their taste for human flesh is not born out of hunger but what appears to be out of pleasure. To ensure their survival, the remnants of humanity began living within defensive barriers, resulting in one hundred years without a single titan encounter. However, that fragile calm is soon shattered when a colossal Titan manages to breach the supposedly impregnable outer wall, reigniting the fight for survival against the man-eating abominations.\\n\\nAfter witnessing a horrific personal loss at the hands of the invading creatures, Eren Yeager dedicates his life to their eradication by enlisting into the Survey Corps, an elite military unit that combats the merciless humanoids outside the protection of the walls. Eren, his adopted sister Mikasa Ackerman, and his childhood friend Armin Arlert join the brutal war against the Titans and race to discover a way of defeating them before the last walls are breached.",
        "image": "https://cdn.myanimelist.net/images/anime/10/47347.jpg"
    },
    {
        "id":"boku-no-hero-academia",
        "title": "Boku no Hero Academia - Season 1",
        "year": 2016,
        "genres": ["Shonen"],
        "studio": "BONES",
        "plot": "The appearance of \"quirks,\" newly discovered super powers, has been steadily increasing over the years, with 80 percent of humanity possessing various abilities from manipulation of elements to shapeshifting. This leaves the remainder of the world completely powerless, and Izuku Midoriya is one such individual. \n\nSince he was a child, the ambitious middle schooler has wanted nothing more than to be a hero. Izuku's unfair fate leaves him admiring heroes and taking notes on them whenever he can. But it seems that his persistence has borne some fruit: Izuku meets the number one hero and his personal idol, All Might. All Might's quirk is a unique ability that can be inherited, and he has chosen Izuku to be his successor!\\n\\nEnduring many months of grueling training, Izuku enrolls in UA High, a prestigious high school famous for its excellent hero training program, and this year's freshmen look especially promising. With his bizarre but talented classmates and the looming threat of a villainous organization, Izuku will soon learn what it really means to be a hero.", 
        "image": "https://cdn.myanimelist.net/images/anime/10/78745.jpg"
    },
{
        "id":"bakuman",
        "title": "Bakuman - Season 1",
        "year": 2010,
        "genres": ["Comedy","Drama","Romance"],
        "studio": "J.C. Staff",
        "plot": "As a child, Moritaka Mashiro dreamt of becoming a mangaka, just like his childhood hero and uncle, Tarou Kawaguchi, creator of a popular gag manga. But when tragedy strikes, he gives up on his dream and spends his middle school days studying, aiming to become a salaryman instead.\n\nOne day, his classmate Akito Takagi, the school's top student and aspiring writer, notices the detailed drawings in Moritaka's notebook. Seeing the vast potential of his artistic talent, Akito approaches Moritaka, proposing that they become mangaka together. After much convincing, Moritaka realizes that if he is able to create a popular manga series, he may be able to get the girl he has a crush on, Miho Azuki, to take part in the anime adaptation as a voice actor. Thus the pair begins creating manga under the pen name Muto Ashirogi, hoping to become the greatest mangaka in Japan, the likes of which no one has ever seen.",
        "image": "https://cdn.myanimelist.net/images/anime/6/26138.jpg"
    },
    {
        "id":"oshi-no-ko",
        "title": "Oshi no Ko - Season 1",
        "year": 2023,
        "genres": ["Drama","Supernatural"],
        "studio": "Doga Kobo",
        "plot": "In the entertainment world, celebrities often show exaggerated versions of themselves to the public, concealing their true thoughts and struggles beneath elaborate lies. Fans buy into these fabrications, showering their idols with undying love and support, until something breaks the illusion. Sixteen-year-old rising star Ai Hoshino of pop idol group B Komachi has the world captivated; however, when she announces a hiatus due to health concerns, the news causes many to become worried.\n\nAs a huge fan of Ai, gynecologist Gorou Amemiya cheers her on from his countryside medical practice, wishing he could meet her in person one day. His wish comes true when Ai shows up at his hospital—not sick, but pregnant with twins! While the doctor promises Ai to safely deliver her children, he wonders if this encounter with the idol will forever change the nature of his relationship with her.",
        "image": "https://cdn.myanimelist.net/images/anime/1812/134736.jpg"
    },
    {
        "id":"code-geass",
        "title": "Code Geass",
        "year": 2006,
        "genres": ["Mecha","Drama","Supernatural"],
        "studio": "Sunrise",
        "plot": "In the year 2010, the Holy Empire of Britannia is establishing itself as a dominant military nation, starting with the conquest of Japan. Renamed to Area 11 after its swift defeat, Japan has seen significant resistance against these tyrants in an attempt to regain independence.\\n\\nLelouch Lamperouge, a Britannian student, unfortunately finds himself caught in a crossfire between the Britannian and the Area 11 rebel armed forces. He is able to escape, however, thanks to the timely appearance of a mysterious girl named C.C., who bestows upon him Geass, the \"Power of Kings\". Realizing the vast potential of his newfound \"power of absolute obedience\", Lelouch embarks upon a perilous journey as the masked vigilante known as Zero, leading a merciless onslaught against Britannia in order to get revenge once and for all.",
        "image":"https://cdn.myanimelist.net/images/anime/1032/135088.jpg"
    },
    {
        "id":"bocchi-the-rock",
        "title": "Bocchi The Rock!",
        "year": 2022,
        "genres": ["Slice of Life","Comedy"],
        "studio": "CloverWorks",
        "plot": "Yearning to make friends and perform live with a band, lonely and socially anxious **Hitori \"Bocchi\" Gotou** devotes her time to playing the guitar. On a fateful day, Bocchi meets the outgoing drummer Nijika Ijichi, who invites her to join Kessoku Band when their guitarist, Ikuyo Kita, flees before their first show. Soon after, Bocchi meets her final bandmate—the cool bassist Ryou Yamada.\n\nAlthough their first performance together is subpar, the girls feel empowered by their shared love for music, and they are soon rejoined by Kita. Finding happiness in performing, Bocchi and her bandmates put their hearts into improving as musicians while making the most of their fleeting high school days.",
        "image":"https://cdn.myanimelist.net/images/anime/1448/127956.jpg"
    }
]
